v2206/Projects/solverTests/cavityFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     ADMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;
writeInterval   10;

// endTime         7200;
// writeInterval   300;

// endTime         86400;  // 1 days simulation
// writeInterval   3600;

// endTime         864000; // 10 days simulation
// writeInterval   3600;

deltaT          1e-3;

writeControl    adjustable;

purgeWrite      0;

writeFormat     ascii; // binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  true;

runTimeModifiable true;

maxCo           1;

maxDeltaT       1;

functions
{
    // U 
    linesample_x_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart				    195;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.0  0.5  -0.005);
				end					(1.0  0.5  -0.005);
				nPoints				500;
			}
		);
		fields	(U);
	}

    linesample_y_U
	{
		type						sets;
		libs						("libsampling.so");
		timeStart				    195;
		writeControl				$writeControl;
		writeInterval				0.5;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(0.5  0.0  -0.005);
				end					(0.5  1.0  -0.005);
				nPoints				500;
			}
		);
		fields	(U);
	}

    // // Sac
    // linesample_x_Sac
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart				    95;
	// 	writeControl				$writeControl;
	// 	writeInterval				0.5;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.0  0.5  -0.005);
	// 			end					(1.0  0.5  -0.005);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sac);
	// }

    // linesample_y_Sac
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart				    95;
	// 	writeControl				$writeControl;
	// 	writeInterval				0.5;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.5  0.0  -0.005);
	// 			end					(0.5  1.0  -0.005);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sac);
	// }

    // // Sch4
    // linesample_x_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart				    95;
	// 	writeControl				$writeControl;
	// 	writeInterval				0.5;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.0  0.5  -0.005);
	// 			end					(1.0  0.5  -0.005);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

    // linesample_y_Sch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart				    95;
	// 	writeControl				$writeControl;
	// 	writeInterval				0.5;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.5  0.0  -0.005);
	// 			end					(0.5  1.0  -0.005);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

    // // Gch4
    // linesample_x_Gch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart				    95;
	// 	writeControl				$writeControl;
	// 	writeInterval				0.5;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.0  0.5  -0.005);
	// 			end					(1.0  0.5  -0.005);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Sch4);
	// }

    // linesample_y_Gch4
	// {
	// 	type						sets;
	// 	libs						("libsampling.so");
	// 	timeStart				    95;
	// 	writeControl				$writeControl;
	// 	writeInterval				0.5;
	// 	interpolationScheme			cell;
	// 	setFormat					csv;
	// 	sets						(
	// 		data
	// 		{
	// 			type				uniform;
	// 			axis				xyz;
	// 			start				(0.5  0.0  -0.005);
	// 			end					(0.5  1.0  -0.005);
	// 			nPoints				500;
	// 		}
	// 	);
	// 	fields	(Gch4);
	// }
}


// ************************************************************************* //
